martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    uint16_t ext_port = portmap_args.ext_port->ival[0];
    const char *ip_str = (char *)portmap_args.int_ip->sval[0];
    uint32_t int_ip = esp_ip4addr_aton(ip_str);

    /* If IP parsing failed (returns IPADDR_NONE), try device name */
    if (int_ip == IPADDR_NONE) {
        if (!resolve_device_name_to_ip(ip_str, &int_ip)) {
            printf("Invalid IP address or device name: %s\n", ip_str);
            return 1;
        }
    }
    uint16_t int_port = portmap_args.int_port->ival[0];

    if (add) {
        /* Validate internal IP is in same /24 network as AP interface */
        if ((int_ip & 0x00FFFFFF) != (my_ap_ip & 0x00FFFFFF)) {
            ip4_addr_t ap_addr, int_addr;
            ap_addr.addr = my_ap_ip;
            int_addr.addr = int_ip;
            printf("Internal IP " IPSTR " must be in same network as AP (" IPSTR "/24)\n",
                   IP2STR(&int_addr), IP2STR(&ap_addr));
            return 1;
        }

        /* Check if external port is already in use for this protocol */
        for (int i = 0; i < IP_PORTMAP_MAX; i++) {
            if (portmap_tab[i].valid &&
                portmap_tab[i].proto == tcp_udp &&
                portmap_tab[i].mport == ext_port) {
                printf("External port %d/%s is already mapped\n",
                       ext_port, tcp_udp == PROTO_TCP ? "TCP" : "UDP");
                return 1;
            }
        }

        uint8_t iface = 0;  // STA (uplink)
        if (portmap_args.iface->count > 0 &&
            strcasecmp(portmap_args.iface->sval[0], "STA") != 0) {
            printf("Interface must be 'STA'\n");
            return 1;
        }

        add_portmap(tcp_udp, ext_port, int_ip, int_port, iface);
    } else {
        del_portmap(tcp_udp, ext_port);
    }

    return ESP_OK;
}

static void register_portmap(void)
{
    portmap_args.add_del = arg_str1(NULL, NULL, "[add|del]", "add or delete portmapping");
    portmap_args.TCP_UDP = arg_str1(NULL, NULL, "[TCP|UDP]", "TCP or UDP port");
    portmap_args.ext_port = arg_int1(NULL, NULL, "<ext_portno>", "external port number");
    portmap_args.int_ip = arg_str1(NULL, NULL, "<int_ip>", "internal IP or device name");
    portmap_args.int_port = arg_int1(NULL, NULL, "<int_portno>", "internal port number");
    portmap_args.iface = arg_str0(NULL, NULL, "[STA]", "interface (default: STA)");
    portmap_args.end = arg_end(6);

    const esp_console_cmd_t cmd = {
        .command = "portmap",
        .help = "Add or delete a portmapping to the router",
        .hint = NULL,
        .func = &portmap,
        .argtable = &portmap_args
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif /* portmap removed */

/* 'show' command arguments */
static struct {
    struct arg_str *type;
    struct arg_end *end;
} show_args;

/* 'show' command implementation */
static int show(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &show_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, show_args.end, argv[0]);
        return 1;
    }

    if (show_args.type->count == 0) {
        printf("Usage: show <status|config|acl|ota>\n");
        printf("  status   - Show router status (connection, clients, memory)\n");
        printf("  config   - Show router configuration (AP/STA settings)\n");
        printf("  acl      - Show firewall ACL rules\n");
        return 1;
    }

    const char *type = show_args.type->sval[0];

    if (strcmp(type, "status") == 0) {
        // Show status
#if CONFIG_REPEATER_MODE
        printf("Repeater Status (L2 bridge):\n");
#else
        printf("Router Status:\n");
#endif
        printf("==============\n");

        // Uptime
        char uptime_str[32];
        format_uptime(get_uptime_seconds(), uptime_str, sizeof(uptime_str));
        char boot_time_str[32];
        format_boot_time(boot_time_str, sizeof(boot_time_str));
        printf("Uptime: %s (since %s)\n", uptime_str, boot_time_str);

        // Connection status
        if (ap_connect) {
            wifi_ap_record_t ap_info;
            if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
#if WIFI_HAS_5GHZ
                printf("Uplink STA: connected (ch %d, %s, %d dBm)\n",
                       ap_info.primary,
                       ap_info.primary > 14 ? "5 GHz" : "2.4 GHz",
                       ap_info.rssi);
#else
                printf("Uplink STA: connected (ch %d, %d dBm)\n", ap_info.primary, ap_info.rssi);
#endif
            } else {
                printf("Uplink AP: connected\n");
            }
        } else {
            printf("Uplink STA: not connected\n");
        }
        if (ap_connect) {
            ip4_addr_t addr;
            addr.addr = my_ip;
            printf("Uplink IP: " IPSTR "\n", IP2STR(&addr));
        } else {
            printf("Uplink IP: none\n");
        }

        // AP interface state
        printf("AP interface: %s\n", ap_disabled ? "disabled" : "enabled");

        // Connected clients
        resync_connect_count();
        printf("Connected clients: %u\n", connect_count);

        // Byte counts
        char _sent_buf[16], _recv_buf[16];
        format_bytes_human(get_sta_bytes_sent(), _sent_buf, sizeof(_sent_buf));
        format_bytes_human(get_sta_bytes_received(), _recv_buf, sizeof(_recv_buf));
        printf("Bytes sent/received: %s / %s\n", _sent_buf, _recv_buf);


#if SOC_TEMP_SENSOR_SUPPORTED
        // CPU temperature
        {
            temperature_sensor_handle_t tsens;
            temperature_sensor_config_t tsens_cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(20, 100);
            //temperature_sensor_config_t tsens_cfg = TEMPERATURE_SENSOR_CONFIG_DEFAULT(-10, 80);
            if (temperature_sensor_install(&tsens_cfg, &tsens) == ESP_OK) {
                float celsius = 0.0f;
                temperature_sensor_enable(tsens);
                if (temperature_sensor_get_celsius(tsens, &celsius) == ESP_OK) {
                    printf("CPU temperature: %.1f °C\n", celsius);
                }
                temperature_sensor_disable(tsens);
                temperature_sensor_uninstall(tsens);
            }
        }
#endif
        // Free heap
        printf("Free heap: %lu bytes\n", (unsigned long)esp_get_free_heap_size());
        if (connect_count > 0) {
            connected_client_t clients[8];
            int count = get_connected_clients(clients, 8);

            if (count > 0) {
                // Fetch per-client traffic stats only when enabled
                client_stats_entry_t stats[CLIENT_STATS_MAX];
                int stats_count = client_stats_enabled ? client_stats_get_all(stats, CLIENT_STATS_MAX) : 0;

                printf("\nClient Details:\n");
                if (client_stats_enabled) {
                    printf("MAC Address        IP Address       Device Name          TX / RX\n");
                    printf("-----------------  ---------------  -------------------  ------------------\n");
                } else {
                    printf("MAC Address        IP Address       Device Name\n");
                    printf("-----------------  ---------------  -------------------\n");
                }

                for (int i = 0; i < count; i++) {
                    char mac_str[18];
                    sprintf(mac_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                            clients[i].mac[0], clients[i].mac[1], clients[i].mac[2],
                            clients[i].mac[3], clients[i].mac[4], clients[i].mac[5]);

