martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
/* 'set_watchdog' command - set reconnect watchdog timeout */
static int set_watchdog_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_watchdog <seconds>\n");
        printf("  seconds: 0-65535 (0 = disabled, default)\n");
        printf("\nCurrent setting: %d s", reconnect_watchdog_s);
        printf(reconnect_watchdog_s == 0 ? " (disabled)\n" : "\n");
        return 0;
    }

    char *endptr;
    long val = strtol(argv[1], &endptr, 10);
    if (*endptr != '\0' || val < 0 || val > 65535) {
        printf("Invalid value. Use 0-65535 (0 = disabled).\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("wd_s", (int32_t)val);
    if (err == ESP_OK) {
        reconnect_watchdog_s = (uint16_t)val;
        if (val == 0) {
            printf("Reconnect watchdog disabled.\n");
        } else {
            printf("Reconnect watchdog set to %ld s.\n", val);
        }
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_watchdog(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_watchdog",
        .help = "Set reconnect watchdog timeout in seconds (0 = disabled, default)",
        .hint = NULL,
        .func = &set_watchdog_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'client_stats' command - enable/disable per-client traffic statistics */
static int client_stats_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Per-client stats: %s\n", client_stats_enabled ? "enabled" : "disabled");
        printf("Usage: client_stats <enable|disable>\n");
        return 0;
    }

    bool enable;
    if (strcmp(argv[1], "enable") == 0) {
        enable = true;
    } else if (strcmp(argv[1], "disable") == 0) {
        enable = false;
    } else {
        printf("Usage: client_stats <enable|disable>\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("cstats_en", enable ? 1 : 0);
    if (err != ESP_OK) {
        printf("Failed to save setting\n");
        return 1;
    }
    client_stats_enabled = enable;
    printf("Per-client stats %s.\n", enable ? "enabled" : "disabled");
    return 0;
}

static void register_client_stats_cmd(void)
{
    const esp_console_cmd_t cmd = {
        .command = "client_stats",
        .help = "Enable or disable per-client traffic statistics",
        .hint = NULL,
        .func = &client_stats_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_ap_nat' command - enable or disable NAT on the AP interface */
static int set_ap_nat_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("NAT: %s\n", ap_nat_enabled ? "enabled" : "disabled (routed mode)");
        printf("Usage: set_ap_nat <on|off>  (requires restart)\n");
        return 0;
    }
    const char *mode = argv[1];
    int val;
    if (strcasecmp(mode, "on") == 0 || strcmp(mode, "1") == 0) {
        val = 1;
    } else if (strcasecmp(mode, "off") == 0 || strcmp(mode, "0") == 0) {
        val = 0;
    } else {
        printf("Usage: set_ap_nat <on|off>\n");
        return 1;
    }
    set_config_param_int("ap_nat", val);
    ap_nat_enabled = (uint8_t)val;
    printf("AP NAT %s. Restart to apply.\n", val ? "enabled" : "disabled (routed mode)");
    return 0;
}

static void register_set_ap_nat(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ap_nat",
        .help = "Enable or disable NAT on the AP interface (default: on). Requires restart.",
        .hint = NULL,
        .func = &set_ap_nat_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_tx_power' command - set WiFi TX power */
static int set_tx_power_cmd(int argc, char **argv)
{
    int8_t current_power = 0;
    esp_err_t ret = esp_wifi_get_max_tx_power(&current_power);

    if (argc < 2) {
        printf("Usage: set_tx_power <dBm>\n");
        printf("  dBm: 2-20 (0 = max/default)\n");
        printf("  Actual steps: 2, 5, 7, 8, 11, 13, 14, 15, 16, 18, 20\n");
        if (ret == ESP_OK) {
            printf("\nCurrent TX power: %.1f dBm (raw: %d)\n", current_power * 0.25, current_power);
        }
        int saved = 0;
        get_config_param_int("tx_power", &saved);
        if (saved > 0) {
            printf("Saved setting: %d dBm\n", saved);
        } else {
            printf("Saved setting: max (default)\n");
        }
        return 0;
    }

    char *endptr;
    long dbm = strtol(argv[1], &endptr, 10);
    if (*endptr != '\0' || (dbm != 0 && (dbm < 2 || dbm > 20))) {
        printf("Invalid value. Use 2-20 dBm (0 = max/default).\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("tx_power", (int32_t)dbm);

    if (err != ESP_OK) {
        printf("Failed to save setting\n");
        return err;
    }

    if (dbm == 0) {
        printf("TX power set to max (default). Restart to apply.\n");
    } else {
        int8_t power_qdbm = (int8_t)(dbm * 4);
        ret = esp_wifi_set_max_tx_power(power_qdbm);
        if (ret == ESP_OK) {
            esp_wifi_get_max_tx_power(&current_power);
            printf("TX power set to %.1f dBm (applied immediately, saved for reboot).\n", current_power * 0.25);
        } else {
            printf("Saved for next reboot. Could not apply now: %s\n", esp_err_to_name(ret));
        }
    }
    return 0;
}

static void register_set_tx_power(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_tx_power",
        .help = "Set WiFi TX power in dBm (2-20, 0 = max/default)",
        .hint = NULL,
        .func = &set_tx_power_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_wifi_country' command - set WiFi regulatory country code */
static int set_wifi_country_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Current country code: %s\n", wifi_country_code);
        printf("Usage: set_wifi_country <CC>\n");
        printf("  CC: 2-char ISO 3166 code (e.g. US, DE, GB) or 01 for world-safe\n");
        printf("  Default: 01 (world-safe, all standard channels allowed)\n");
        return 0;
    }

    const char *cc = argv[1];
    if (strlen(cc) != 2) {
        printf("Country code must be exactly 2 characters (e.g. US, DE, 01).\n");
        return 1;
    }

    char upper[3];
    upper[0] = toupper((unsigned char)cc[0]);
    upper[1] = toupper((unsigned char)cc[1]);
    upper[2] = '\0';

