martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
/* 'set_tz' command - set timezone */
static int set_tz_cmd(int argc, char **argv)
{
    if (argc < 2) {
        const char *tz = getenv("TZ");
        printf("Timezone: %s\n", tz ? tz : "(not set, using UTC)");
        printf("\nUsage: set_tz <POSIX TZ string>\n");
        printf("Examples:\n");
        printf("  set_tz UTC               - UTC\n");
        printf("  set_tz CET-1CEST,M3.5.0,M10.5.0/3  - Central Europe\n");
        printf("  set_tz EST5EDT,M3.2.0,M11.1.0       - US Eastern\n");
        printf("  set_tz PST8PDT,M3.2.0,M11.1.0       - US Pacific\n");
        printf("  set_tz clear             - Clear timezone (revert to UTC)\n");
        return 0;
    }

    if (strcmp(argv[1], "clear") == 0) {
        unsetenv("TZ");
        tzset();
        set_config_param_str("tz", "");
        printf("Timezone cleared (using UTC).\n");
        return 0;
    }

    setenv("TZ", argv[1], 1);
    tzset();
    set_config_param_str("tz", argv[1]);

    /* Show current time to confirm */
    time_t now = time(NULL);
    struct tm tm_info;
    localtime_r(&now, &tm_info);
    char buf[32];
    strftime(buf, sizeof(buf), "%Y-%m-%d %H:%M:%S %Z", &tm_info);
    printf("Timezone set to: %s\n", argv[1]);
    printf("Current time:    %s\n", buf);

    return 0;
}

static void register_set_tz(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_tz",
        .help = "Set timezone (POSIX TZ string)\n"
                "  set_tz                   - Show current timezone\n"
                "  set_tz <TZ string>       - Set timezone\n"
                "  set_tz clear             - Clear timezone (revert to UTC)",
        .hint = " <TZ string>",
        .func = &set_tz_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32S3)

/* 'set_oled' command - enable/disable OLED display */
static int set_oled_cmd(int argc, char **argv)
{
    if (argc < 2) {
        bool enabled;
        int sda, scl;
        oled_display_get_config(&enabled, &sda, &scl);
        printf("OLED display: %s\n", enabled ? "enabled" : "disabled");
        printf("I2C GPIOs: SDA=%d, SCL=%d\n", sda, scl);
        printf("\nUsage: set_oled <enable|disable>\n");
        return 0;
    }

    const char *action = argv[1];
    if (strcmp(action, "enable") == 0) {
        oled_display_enable();
        printf("OLED display will be enabled after reboot.\n");
    } else if (strcmp(action, "disable") == 0) {
        oled_display_disable();
        printf("OLED display will be disabled after reboot.\n");
    } else {
        printf("Unknown action: %s\n", action);
        printf("Usage: set_oled <enable|disable>\n");
        return 1;
    }

    return 0;
}

static void register_set_oled(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_oled",
        .help = "Enable or disable OLED display\n"
                "  set_oled              - Show current status\n"
                "  set_oled enable       - Enable OLED display (after reboot)\n"
                "  set_oled disable      - Disable OLED display (after reboot)",
        .hint = " <enable|disable>",
        .func = &set_oled_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_oled_gpio' command - configure I2C pins for OLED */
static int set_oled_gpio_cmd(int argc, char **argv)
{
    if (argc < 3) {
        bool enabled;
        int sda, scl;
        oled_display_get_config(&enabled, &sda, &scl);
        printf("Current OLED I2C GPIOs: SDA=%d, SCL=%d\n", sda, scl);
        printf("\nUsage: set_oled_gpio <sda> <scl>\n");
        return 0;
    }

    char *endptr;
    int sda = strtol(argv[1], &endptr, 10);
    if (*endptr != '\0' || sda < 0 || sda > 48) {
        printf("Invalid SDA GPIO. Use 0-48.\n");
        return 1;
    }
    int scl = strtol(argv[2], &endptr, 10);
    if (*endptr != '\0' || scl < 0 || scl > 48) {
        printf("Invalid SCL GPIO. Use 0-48.\n");
        return 1;
    }
    if (sda == scl) {
        printf("SDA and SCL must be different GPIOs.\n");
        return 1;
    }

    oled_display_set_gpio(sda, scl);
    printf("OLED I2C GPIOs set to SDA=%d, SCL=%d.\n", sda, scl);
    printf("Restart the device for changes to take effect.\n");
    return 0;
}

static void register_set_oled_gpio(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_oled_gpio",
        .help = "Set I2C GPIO pins for OLED display (requires restart)",
        .hint = " <sda> <scl>",
        .func = &set_oled_gpio_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#endif /* CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32S3 */

/* Helper function to convert auth mode to string */
static const char* auth_mode_to_str(wifi_auth_mode_t authmode)
{
    switch (authmode) {
        case WIFI_AUTH_OPEN:            return "Open";
        case WIFI_AUTH_WEP:             return "WEP";
        case WIFI_AUTH_WPA_PSK:         return "WPA";
        case WIFI_AUTH_WPA2_PSK:        return "WPA2";
        case WIFI_AUTH_WPA_WPA2_PSK:    return "WPA/WPA2";
        case WIFI_AUTH_WPA3_PSK:        return "WPA3";
        case WIFI_AUTH_WPA2_WPA3_PSK:   return "WPA2/WPA3";
        case WIFI_AUTH_WPA2_ENTERPRISE: return "WPA2-Ent";
        default:                        return "Unknown";
    }
}

/* 'scan' command implementation */
static int scan_cmd(int argc, char **argv)
{
    wifi_scan_config_t scan_config = {
        .ssid = NULL,
        .bssid = NULL,
        .channel = 0,
        .show_hidden = true,
        .scan_type = WIFI_SCAN_TYPE_ACTIVE,
    };

    /* Stop connection attempts so they don't interfere with scanning */
    if (!ap_connect) {
        wifi_scan_active = true;
        esp_wifi_disconnect();
        vTaskDelay(pdMS_TO_TICKS(100));  /* Let disconnect complete */
    }

    printf("Scanning for WiFi networks...\n");
    esp_err_t err = esp_wifi_scan_start(&scan_config, true);  /* Blocking scan */

    /* Read results BEFORE clearing flag or reconnecting, so nothing
     * can interfere with the scan result buffer. */
    uint16_t ap_count = 0;
    wifi_ap_record_t *ap_list = NULL;

    if (err == ESP_OK) {
        esp_wifi_scan_get_ap_num(&ap_count);
        if (ap_count > 0) {
            ap_list = malloc(sizeof(wifi_ap_record_t) * ap_count);
            if (ap_list != NULL) {
                esp_wifi_scan_get_ap_records(&ap_count, ap_list);
            } else {
                ap_count = 0;
            }
        }
    }

    /* Now safe to resume connection attempts */
    wifi_scan_active = false;
    if (!ap_connect) {
        esp_wifi_connect();
    }

    if (err != ESP_OK) {
        printf("Scan failed: %s\n", esp_err_to_name(err));
        return 1;
    }

    if (ap_count == 0) {
        printf("No networks found.\n");
        return 0;
    }

    /* Print header */
    printf("\nFound %d networks:\n", ap_count);
#if WIFI_HAS_5GHZ
    printf("%-32s  %3s  %5s  %4s  %-12s\n", "SSID", "Ch", "Band", "RSSI", "Security");
    printf("--------------------------------  ---  -----  ----  ------------\n");

    for (int i = 0; i < ap_count; i++) {
        const char *auth = auth_mode_to_str(ap_list[i].authmode);
        printf("%-32s  %3d  %5s  %4d  %s\n", ap_list[i].ssid, ap_list[i].primary,
               ap_list[i].primary > 14 ? "5 GHz" : "2.4 G", ap_list[i].rssi, auth);
    }
#else
    printf("%-32s  %3s  %4s  %-12s\n", "SSID", "Ch", "RSSI", "Security");
    printf("--------------------------------  ---  ----  ------------\n");

    for (int i = 0; i < ap_count; i++) {
        const char *auth = auth_mode_to_str(ap_list[i].authmode);
        printf("%-32s  %3d  %4d  %s\n", ap_list[i].ssid, ap_list[i].primary, ap_list[i].rssi, auth);
    }
#endif

    free(ap_list);
    return 0;
}

static void register_scan(void)
{
    const esp_console_cmd_t cmd = {
        .command = "scan",
        .help = "Scan for available WiFi networks",
        .hint = NULL,
        .func = &scan_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
